Tekla Open API Reference for Tekla Structures 2025
CrossSection.Location Property
 The location in relation to length, 0.0 referring to start of the profile
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double Location { get; }
Public ReadOnly Property Location As Double
	Get
Property Value
Type: Double
See Also
Reference
CrossSection Class
Tekla.Structures.Catalogs Namespace